Ran Plan for 5 projects:

1. project: `fileflow-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `fileflow-redis-prod` dir: `terraform/elasticache-redis` workspace: `default`
1. project: `fileflow-s3-prod` dir: `terraform/s3-bucket` workspace: `default`
1. project: `fileflow-sqs-prod` dir: `terraform/sqs-queue` workspace: `default`
1. project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`
---

### 1. project: `fileflow-ecr-prod` dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.fileflow will be created
+ resource "aws_ecr_lifecycle_policy" "fileflow" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "최근 10개 이미지만 유지"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "prod-",
                              + "release-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "태그 없는 이미지 7일 후 삭제"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "fileflow-prod"
    }

  # aws_ecr_repository.fileflow will be created
+ resource "aws_ecr_repository" "fileflow" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "fileflow-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-prod-ecr"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow"
          + "Team"        = "platform-team"
        }
      + tags_all             = {
          + "Component"   = "ecr"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-prod-ecr"
          + "Project"     = "fileflow"
          + "Service"     = "fileflow"
          + "Team"        = "platform-team"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.fileflow_github_actions will be created
+ resource "aws_ecr_repository_policy" "fileflow_github_actions" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:role/GitHubActionsRole"
                        }
                      + Sid       = "AllowGitHubActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "fileflow-prod"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ registry_id     = (known after apply)
+ repository_arn  = (known after apply)
+ repository_name = "fileflow-prod"
+ repository_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecr-prod
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `fileflow-redis-prod` dir: `terraform/elasticache-redis` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/79/default/terraform/elasticache-redis/fileflow-redis-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/79/default/terraform/elasticache-redis": exit status 1
aws_elasticache_parameter_group.main: Refreshing state... [id=fileflow-redis-prod]
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.private_subnet_ids: Reading...
aws_cloudwatch_log_group.redis_slow: Refreshing state... [id=/aws/elasticache/fileflow-redis-prod/slow-log]
aws_cloudwatch_log_group.redis_engine: Refreshing state... [id=/aws/elasticache/fileflow-redis-prod/engine-log]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.private_subnet_ids: Read complete after 0s [id=/shared/network/private-subnet-ids]
aws_elasticache_subnet_group.main: Refreshing state... [id=fileflow-redis-prod]
aws_security_group.redis: Refreshing state... [id=sg-03e4b1f12a3bd2a18]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading ElastiCache Parameter Group (fileflow-redis-prod) parameters: operation error ElastiCache: DescribeCacheParameters, https response error StatusCode: 403, RequestID: cfbaa847-69c7-48c6-8b97-8ea4c5439dac, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/513f65056f15452f8b227e779549e854 is not authorized to perform: elasticache:DescribeCacheParameters on resource: arn:aws:elasticache:ap-northeast-2:646886795421:parametergroup:fileflow-redis-prod because no identity-based policy allows the elasticache:DescribeCacheParameters action
│ 
│   with aws_elasticache_parameter_group.main,
│   on main.tf line 77, in resource "aws_elasticache_parameter_group" "main":
│   77: resource "aws_elasticache_parameter_group" "main" {
│ 
╵


```
</details>

---
### 3. project: `fileflow-s3-prod` dir: `terraform/s3-bucket` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.main has been deleted
- resource "aws_s3_bucket" "main" {
      - arn                         = "arn:aws:s3:::fileflow--prod" -> null
      - bucket_domain_name          = "fileflow--prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "fileflow--prod.s3.ap-northeast-2.amazonaws.com" -> null
      - id                          = "fileflow--prod" -> null
        tags                        = {
            "Component"   = "storage"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "Name"        = "fileflow--prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Purpose"     = null
            "Service"     = "fileflow"
        }
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.s3_access must be replaced
-/+ resource "aws_cloudwatch_log_group" "s3_access" {
      ~ arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/s3/fileflow--prod" -> (known after apply)
      ~ id                = "/aws/s3/fileflow--prod" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/s3/fileflow--prod" -> "/aws/s3/fileflow-prod" # forces replacement
      + name_prefix       = (known after apply)
      ~ tags              = {
            "Component"   = "s3-logging"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "log-fileflow--prod" -> "log-fileflow-prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all          = {
          ~ "Name"        = "log-fileflow--prod" -> "log-fileflow-prod"
            # (7 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_kms_alias.s3 must be replaced
-/+ resource "aws_kms_alias" "s3" {
      ~ arn            = "arn:aws:kms:ap-northeast-2:646886795421:alias/fileflow--prod" -> (known after apply)
      ~ id             = "alias/fileflow--prod" -> (known after apply)
      ~ name           = "alias/fileflow--prod" -> "alias/fileflow-prod" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_kms_key.s3 will be updated in-place
~ resource "aws_kms_key" "s3" {
      ~ description                        = "KMS key for fileflow--prod S3 bucket" -> "KMS key for fileflow-prod S3 bucket"
        id                                 = "de3fcbd6-a155-4245-bdeb-d626ef4038ce"
      ~ tags                               = {
            "Component"   = "s3-encryption"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "kms-fileflow--prod" -> "kms-fileflow-prod"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all                           = {
          ~ "Name"        = "kms-fileflow--prod" -> "kms-fileflow-prod"
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "fileflow-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "storage"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "fileflow-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Purpose"     = null
          + "Service"     = "fileflow"
        }
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.main will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "transition-to-ia"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER_IR"
            }
        }
      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "delete-incomplete-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_policy.main will be created
+ resource "aws_s3_bucket_policy" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.main will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:ap-northeast-2:646886795421:key/de3fcbd6-a155-4245-bdeb-d626ef4038ce"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ssm_parameter.bucket_arn will be updated in-place
~ resource "aws_ssm_parameter" "bucket_arn" {
        id              = "/fileflow/prod/s3/bucket-arn"
      + insecure_value  = (known after apply)
        name            = "/fileflow/prod/s3/bucket-arn"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-arn" -> "ssm-fileflow-prod-arn"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-arn" -> "ssm-fileflow-prod-arn"
            # (7 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.bucket_name will be updated in-place
~ resource "aws_ssm_parameter" "bucket_name" {
        id              = "/fileflow/prod/s3/bucket-name"
      + insecure_value  = (known after apply)
        name            = "/fileflow/prod/s3/bucket-name"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-name" -> "ssm-fileflow-prod-name"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-name" -> "ssm-fileflow-prod-name"
            # (7 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.kms_key_id will be updated in-place
~ resource "aws_ssm_parameter" "kms_key_id" {
        id              = "/fileflow/prod/s3/kms-key-id"
        name            = "/fileflow/prod/s3/kms-key-id"
      ~ tags            = {
            "Component"   = "parameter-store"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            "Owner"       = "platform-team@ryuqqq.com"
            "Service"     = "fileflow"
        }
      ~ tags_all        = {
          ~ "Name"        = "ssm-fileflow--prod-kms" -> "ssm-fileflow-prod-kms"
            # (7 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

Plan: 8 to add, 4 to change, 2 to destroy.

Changes to Outputs:
~ bucket_arn                  = "arn:aws:s3:::fileflow--prod" -> (known after apply)
~ bucket_domain_name          = "fileflow--prod.s3.amazonaws.com" -> (known after apply)
~ bucket_id                   = "fileflow--prod" -> (known after apply)
~ bucket_regional_domain_name = "fileflow--prod.s3.ap-northeast-2.amazonaws.com" -> (known after apply)
~ log_group_name              = "/aws/s3/fileflow--prod" -> "/aws/s3/fileflow-prod"
╷
│ Warning: AWS resource not found during refresh
│ 
│   with aws_s3_bucket_lifecycle_configuration.main,
│   on main.tf line 140, in resource "aws_s3_bucket_lifecycle_configuration" "main":
│  140: resource "aws_s3_bucket_lifecycle_configuration" "main" {
│ 
│ Automatically removing from Terraform State instead of returning the error,
│ which may trigger resource recreation. Original error: couldn't find
│ resource
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-s3-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fs3-bucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-s3-prod
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 4 to change, 2 to destroy.

---
### 4. project: `fileflow-sqs-prod` dir: `terraform/sqs-queue` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-sqs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fsqs-queue%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-sqs-prod
  ```

---
### 5. project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/79/default/terraform/ecs-service/fileflow-ecs-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/79/default/terraform/ecs-service": exit status 1
╷
│ Error: Error acquiring the state lock
│ 
│ Error message: operation error DynamoDB: PutItem, https response error
│ StatusCode: 400, RequestID:
│ SUKAC4PVB1NHUJ73Q7J9CIOUCFVV4KQNSO5AEMVJF66Q9ASUAAJG,
│ ConditionalCheckFailedException: The conditional request failed
│ Lock Info:
│   ID:        de38003d-fdfb-2e39-d843-2f284e8cb49b
│   Path:      prod-connectly/fileflow/ecs-service/terraform.tfstate
│   Operation: OperationTypePlan
│   Who:       sangwon-ryu@lyusang-won-ui-MacBookPro.local
│   Version:   1.12.2
│   Created:   2025-10-29 01:20:41.307637 +0000 UTC
│   Info:      
│ 
│ 
│ Terraform acquires a state lock to protect the state from being written
│ by multiple users at the same time. Please resolve the issue above and try
│ again. For most commands, you can disable locking with the "-lock=false"
│ flag, but this is not recommended.
╵

```
</details>

---
### Plan Summary

5 projects, 2 with changes, 1 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```